---
kind: property
id: P:Autodesk.Revit.DB.LeaderArray.IsEmpty
source: html/4eddb879-337c-66a8-b223-0c8054ce0688.htm
---
# Autodesk.Revit.DB.LeaderArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.